Repository: bit-part/craftcms_docs-ja
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: 'medium' (default)
ja: 'medium'（デフォルト）

source: ($_SERVER['SERVER_NAME'] will be used by default.)
ja: （デフォルトでは、$_SERVER['SERVER_NAME'] が使用されます。）

source: (inReverse() will reverse the sort direction of all of the ORDER BY columns in the generated SQL.)
ja: （inReverse() は、生成された SQL のすべての ORDER BY カラムのソート方向を反転させます。）

source: (Default is no limit.)
ja: （デフォルトは無制限です）

source: (Default is no limit.) Note that this does include parent categories, if your category group has multiple levels.
ja: （デフォルトは無制限です） カテゴリグループが複数の階層を持つ場合、ここに親カテゴリも含まれます。

source: (Default is “All”)
ja: （デフォルトは「すべて」です）

source: (Default is “All”.)
ja: （デフォルトは「すべて」です）

source: (Don’t set this until you have a valid license key.)
ja: （有効なライセンスキーを取得するまで、これをセットしないでください。）

source: (It is assumed to be the parent of the vendor/ directory by default.)
ja: （デフォルトでは、vendor/ ディレクトリの親とみなされます。）

source: (It is assumed to live 4 directories up from the bootstrap script by default.)
ja: （デフォルトでは、起動スクリプトによって4つのディレクトリが稼働しているものとします。）

source: (It is assumed to live within the base directory by default.)
ja: （デフォルトでは、ベースディレクトリ内に存在するものとします。）

source: (It will be stored as license.key within your config/ directory by default.)
ja: （デフォルトでは、config/ ディレクトリ内に license.key として保存されます。）

source: (Note that the returned position is 0-indexed.) If no position can be found, -1 is returned instead.
ja: （返される位置は、0 からはじまることに注意してください。）見つからなかった場合、代わりに -1 が返されます。

source: (Note that you should create your Craft 3 project in a new location; not in the same place as your Craft 2 project).
ja: （Craft 2 プロジェクトと同じ場所ではなく、新しい場所に Craft 3 プロジェクトを作成する必要があります。）

source: (Only do this if you set your relational field to be translatable.) You can set this to a locale ID.
ja: （関連フィールドを翻訳可能にしている場合のみ、これを行います。）ロケール ID をここにセットします。

source: (Only set this if you have a good reason to.
ja: （明確な理由がある場合のみ、これをセットしてください。

source: (Plugin handles must begin with a letter and contain only lowercase letters, numbers, and dashes.
ja: （プラグインハンドルは、文字で始まり、小文字の英字、数字、およびダッシュのみでなければなりません。

source: (See Relations for more info on the relatedTo param.)
ja: （relatedTo パラメータの詳細は、リレーションを見てください。）

source: (See Configuration for more info.)
ja: （詳細については、コンフィギュレーションを参照してください。）

source: (See Composer’s for details.) We recommend prefixing the second segment (after the /) with craft-, to help identify that this is a Craft plugin.
ja: （詳細については、 を参照してください。）これが Craft のプラグインだと識別する手助けになるため、2番目のセグメント（/ の後）に接頭辞 craft- を付けることをお勧めします。

source: (See the autoloading specification for details.) Note that this should not begin with craft\; use something that identifies you, the developer.
ja: （詳細については、 オートローディング仕様を参照してください。）これは craft\ で始めるべき ではない ことに注意してください。あなたやデベロッパーを識別する何かを使用してください。

source: (See the plugins’ documentation for any additional upgrade instructions.)
ja: （追加のアップグレードガイドについては、プラグインのドキュメントを参照してください。）

source: (The ../my-plugin example value assumes that the plugin lives in a folder alongside the project’s folder.) :::
ja: （サンプルの ../my-plugin は、プロジェクトフォルダーと並んでプラグインのフォルダが存在することを前提としています。） :::

source: (The DateTime object is represented by the d variable.
ja: （DateTime オブジェクトは、変数 d で表されます。

source: (The “year” token, for example, represents four consecutive digits.) When you click on a token, Craft inserts it into the URI setting wherever the cursor is.
ja: （例えば、“year” トークンは4桁の連続する数字を表します。） トークンをクリックすると、Craft は URI 設定欄のカーソル位置にそれを挿入します。

source: (There’s no length limit.)
ja: （長さに制限はありません。）

source: (This can be renamed if needed.)
ja: （必要ならリネームできます。）

source: (This can be useful if the URL will be used by POST requests over Ajax, where the URL will not be shown in the browser’s address bar, and you want to avoid a possible collision with your site’s .htaccess file redirect.)
ja: （ブラウザのアドレスバーに表示されない URL と .htaccess ファイルのリダイレクトとの衝突を避けたいような、Ajax 経由の POST リクエストで使用される URL の場合に有用です。）

source: (This is the default mode.)
ja: （これがデフォルトのモードです。）

source: (This step is not limited to entries and categories – plugins are also capable of adding their own types of elements, which can opt to have their own dedicated URLs.)
ja: （このステップは、エントリやカテゴリに制限されません。プラグインもまた、エレメントの種類を追加したり、専用の URL を持つように決めることができます。）

source: (Use double-backslashes because JSON, and note this must end with \\.)
ja: （JSON のために二重バックスラッシュを使用し、最後が \\ でなければならない点に注意してください。）

source: (Use the same package name you gave your plugin in its composer.json file.)
ja: （composer.json ファイルでプラグインに付けたパッケージ名と同じものを使用してください。）

source: (checks for `null` or an empty string)
ja: （`null`、または、空の文字列かどうかのチェック）

source: (implied `'or'`)
ja: （暗黙の `'or'`）

source: (install it globally)
ja: （グローバルへのインストール）

source: (n/a)
ja: （該当なし）

source: (no replacement needed; just delete it)
ja: （置き換えが必要なのではなく、単に削除してください）

source: (normal Twig syntax)
ja: （標準の Twig 構文）

source: (optional)
ja: （オプション）

source: (optional) – The element property that the reference tag should return.
ja: （オプション） – リファレンスタグが返すべきエレメントのプロパティ。

source: (see [`last()`](last))
ja: （ [`last()`](last) を見てください）

source: (shortcut syntax)
ja: （ショートカット構文）

source: (treated as a string)
ja: （文字列として扱われる）

source: (write your own media selector)
ja: （自身のメディアセレクタを記述します）

source: *3 Settings that supported Environment Variables in Craft 2 now support Aliases in Craft 3.
ja: *3 Craft 2 で環境変数をサポートしていた設定は、Craft 3 の エイリアス でサポートされるようになりました。

source: .env configuration file.
ja: .env 設定ファイルです。

source: .env file template.
ja: .env ファイルのひな形です。

source: ::: danger Accessing things via craft.app is considered highly advanced.
ja: ::: danger craft.app 経由でアクセスすることは、高度な進化だと考えられます。

source: ::: tip Craft doesn’t require you to create additional web/ directories for new sites, though it’s fine if you need to.
ja: ::: tip 必要とするならうまくできますが、Craft では新しいサイトのために追加の web/ ディレクトリを作成する必要はありません。

source: ::: tip Don’t forget to set DB_TABLE_PREFIX="craft" if that’s what your database tables are prefixed with.
ja: ::: tip 現在のテーブル接頭辞がそれである場合、DB_TABLE_PREFIX="craft" を忘れずにセットしてください。

source: ::: tip Don’t include composer/installers as a Composer dependency.
ja: ::: tip composer/installers を Composer 依存として含めないでください。

source: ::: tip If the Setup Wizard skips this step, it’s because Craft is already able to connect to your database.
ja: ::: tip Craft がすでにデータベースに接続可能な状態であれば、このステップはスキップされます。

source: ::: tip If you have multiple sites using different root domains like https://site-a.com and https://site-b.com, with the way Craft’s license enforcements works, you’ll want to pick one of the domains to access the Craft Control Panel from for all of the sites.
ja: ::: tip https://site-a.com と https://site-b.com のような異なるルートドメインを使用する複数サイトを持つ場合、Craft の license enforcements works の仕組みによって、すべて のサイトのためにアクセスする Craft コントロールパネルのドメインをその中の1つから選択することができます。

source: ::: tip If you save this in a template that ends with a .rss file extension, Craft will even serve it with an application/rss+xml MIME type.
ja: ::: tip ファイル拡張子 .rss で終わるテンプレートとして保存すると、Craft はそれを MIME タイプ application/rss+xml で配信します。

source: ::: tip If you save this in a template that ends with an .atom file extension, Craft will even serve it with an application/atom+xml MIME type.
ja: ::: tip ファイル拡張子 .atom で終わるテンプレートとして保存すると、Craft はそれを MIME タイプ application/atom+xml で配信します。

source: ::: tip If you used Composer to download Craft, you can probably safely skip this step.
ja: ::: tip Craft のダウンロードに Composer を利用した場合、おそらく安全にこのステップをスキップできます。

source: ::: tip If your Craft install is running from a Vagrant box, you will need to SSH into the box to run this command.
ja: ::: tip Craft のインストールが Vagrant box から実行されている場合、このコマンドを実行するために box に SSH 接続する必要があります。

source: ::: tip If your queue driver supplies its own worker, set the config setting to false in config/general.php.
ja: ::: tip キュードライバが独自のワーカーを提供している場合、config/general.php の コンフィグ設定を false に設定します。

source: ::: tip If you’re on macOS, be careful not to lose the hidden files in there (.env, .env.example, .gitignore, and web/.htaccess).
ja: ::: tip macOS を使用している場合、そこにある不可視ファイル（.env、.env.example、.gitignore、および web/.htaccess）を失わないよう注意してください。

source: ::: tip Migration names must be valid PHP class names, though we recommend sticking with snake_case rather than StudlyCase as a convention.
ja: ::: tip マイグレーション名は有効な PHP クラス名でなければなりません。慣習として、StudlyCase よりも snake_case を使うことをお勧めします。

source: ::: tip Set the url value to the absolute or relative path to your plugin’s source directory.
ja: ::: tip url 値にプラグインのソースディレクトリを絶対パスまたは相対パスで設定します。

source: ::: tip The name of your plugin directory doesn’t matter.
ja: ::: tip プラグインのディレクトリ名は重要ではありません。

source: ::: tip The tag calls under the hood, which can also be accessed via the global view variable.
ja: ::: tip タグを の中で呼び出し、グローバルな view 変数経由でアクセスすることもできます。

source: ::: tip The tag calls yii\web\View::registerCss() under the hood, which can also be accessed via the global view variable.
ja: ::: tip タグを yii\web\View::registerCss() の中で呼び出し、グローバルな view 変数経由でアクセスすることもできます。

source: ::: tip The tag calls yii\web\View::registerJs() under the hood, which can also be accessed via the global view variable.
ja: ::: tip タグを yii\web\View::registerJs() の中で呼び出し、グローバルな view 変数経由でアクセスすることもできます。

source: ::: tip Unlike entries, Global Sets don’t have the Live Preview feature, since they aren’t associated with any one particular URL.
ja: ::: tip エントリとは異なり、特定の URL と関連付けられていないグローバル設定では、ライブプレビュー機能がありません。

source: ::: tip Use pluginfactory.io to create your plugin’s scaffolding with just a few clicks.
ja: ::: tip 数クリックでプラグインの土台を作成できる pluginfactory.io を利用してください。

source: ::: tip While not strictly required by Composer, we recommend you explicitly set the version in your composer.json because it makes a couple things easier on your when developing the plugin.
ja: ::: tip Composer が厳密に要求しているわけではありませんが、プラグインを開発する際にいくつかのことが簡単に行えるよう、composer.json へ明示的に version を設定することをお勧めします。

source: ::: tip You can alter the default behavior of search terms with the config setting.
ja: ::: tip コンフィグ設定の で、検索語のデフォルトの振る舞いを変更することができます。

source: ::: tip You can combine this parameter with globally to cache templates on a per-page basis, without letting any query string variables get included in the path:
ja: ::: tip クエリ文字列の変数をパスに含めることなく、ページごとのテンプレートをキャッシュするために globally パラメータを組み合わせることができます。

source: ::: tip You can only nest categories up to the level specified in the Max Level field Category Group settings.
ja: ::: tip カテゴリグループの設定にある最大レベル欄で指定したレベルまでしか、カテゴリをネストできません。

source: ::: tip You can only use for
ja: ::: tip for

source: ::: tip You can only use if
ja: ::: tip if

source: ::: tip You can override the Volume settings using the config/volumes.php configuration file.
ja: ::: tip 設定ファイルの config/volumes.php を利用して、ボリューム設定を上書きできます。

source: ::: tip You can use the url() function for appending query string parameters and/or enforcing a protocol on an absolute URL:
ja: ::: tip クエリ文字列パラメータを追加する、および / または、絶対 URL にプロトコルを適用するために、url() ファンクションを使うことができます。

source: ::: tip You should be running Composer 1.3.0 or later.
ja: ::: tip Composer 1.3.0 以降を稼働させるべきです。

source: ::: warning If you change the template code within a {% cache %} that uses a custom key, any existing template caches will not automatically be purged.
ja: ::: warning カスタムキーを利用している {% cache %} 内のテンプレートコードを変更する場合、既存のテンプレートキャッシュは自動的にパージされません。

source: ::: warning One caveat of path Composer repositories is that Composer will ignore path-based dependencies when you run composer update.
ja: ::: warning path Composer リポジトリの難点の1つは、composer update を実行した際に Composer が path ベースの依存関係を無視することです。

source: ::: warning Only drivers that implement will be visible within the Control Panel.
ja: ::: warning を実装しているドライバだけがコントロールパネル内に表示されます。

source: ::: warning Setting the position to on load or on ready will cause Craft to load its internal copy of jQuery onto the page (even if the template is already including its own copy), so you should probably avoid using them in front-end templates.
ja: ::: warning on load または on ready に位置をセットすると、（テンプレートがすでに独自のコピーを含めている場合でも）Craft はページに jQuery の内部コピーを読み込みます。そのため、フロントエンドのテンプレートで利用するのは避けてください。

source: ::: warning You must create your volumes within the Control Panel before Craft will start checking config/volumes.php for overrides.
ja: ::: warning Craft が上書きのために config/volumes.php をチェックしはじめる前に、コントロールパネルでボリュームを作成しておく必要があります。

source: ::: warning HEY IIS FANS Make sure your site’s AppPool account has write permissions to these folders/files as well.
ja: ::: warning IS ファンへ サイトの AppPool アカウントがこれらのフォルダやファイルに書き込み権限を持っていることを確認してください。

source: :::warning If Craft CMS needs to process very large images or dump very large databases, you might need to bump PHP’s memory allocation up to 256MB.
ja: :::warning Craft CMS が非常に大きな画像の処理、または、データベースのダンプをする必要がある場合、PHP の割当メモリを256MBまで増やす必要があります。

source: 1 Only available if the `queue` component implements <api:craft\queue\QueueInterface>.
ja: 1 `queue` コンポーネントが <api:craft\queue\QueueInterface> を実装している場合のみ、使用可能です。

source: 1 Only available if the `queue` component implements `craft\queue\QueueInterface`.
ja: 1 `queue` コンポーネントが `craft\queue\QueueInterface` を実装している場合のみ、使用可能です。

source: 1 Performance should no longer be a major factor when setting `backupOnUpdate` to `false`, since backups aren’t generated by PHP anymore.
ja: 1 `backupOnUpdate` を `false` にすると、PHP によるバックアップの生成が行われないため、パフォーマンスは大きな要因になりえません。

source: 2 `defaultFileMode` is now `null` by default, meaning it will be determined by the current environment.
ja: 2 `defaultFileMode` はデフォルトで `null` になりました。これは、現在の環境によって決定されることを意味します。

source: 4 `securityKey` is no longer optional.
ja: 4 `securityKey` は、もはやオプションではありません。

source: – Either the element’s ID or a custom identifier supported by the element type.
ja: – エレメントの ID、または、エレメントタイプによってサポートされているカスタム識別子。

source: – The type of element you’re creating a reference to.
ja: – 参照を作成するエレメントのタイプ。

source: Check out the Craft setup command.
ja: Craft をコマンドラインでセットアップする項をチェックしてください。

source: PHP dotenv, which the craftcms/craft project comes with pre-installed, processes the .env file.
ja: craftcms/craft プロジェクトと一緒にプリインストールされる PHP dotenv が、.env ファイルを処理します。

source: where the ‘body’ field begins with “salty”.
ja: ‘body’ フィールドが「salty」ではじまる

source: sal* | containing a word that begins with “sal”.
ja: sal* | 「sal」ではじまる単語を含んでいる

source: where the ‘body’ field is set to “salty dog” and nothing more.
ja: ‘body’ フィールドに「salty dog」がセットされ、それ以外のものがない

source: where the ‘body’ field contains any value.
ja: ‘body’ フィールドになんらかの値を含む

source: *ty | containing a word that ends with “ty”.
ja: *ty | 「ty」で終わる単語を含んでいる

source: containing the word “salty”.
ja: 「salty」という単語を含んでいる

source: *alt* | containing a word that contains “alt”.
ja: *alt* | 「alt」を含む単語を含んでいる

source: body:salty | where the body field contains “salty”.
ja: body:salty | body フィールドに「salty」を含む

source: where the ‘body’ field contains “salty”.
ja: ‘body’ フィールドに「salty」を含む

source: body:salty body:dog | where the body field contains both “salty” and “dog”.
ja: body:salty body:dog | body フィールドに「salty」と「dog」の両方を含む

source: body:salty OR body:dog | where the body field contains either “salty” or “dog”.
ja: body:salty OR body:dog | body フィールドに「salty」または「dog」のいずれかを含む

source: containing both “salty” and “dog”.
ja: 「salty」と「dog」の両方を含んでいる

source: body:salty -body:dog | where the body field contains “salty” but not “dog”.
ja: body:salty -body:dog | body フィールドに「salty」を含むが「dog」を含まない

source: salty dog | containing both “salty” and “dog”.
ja: salty dog | 「salty」と「dog」の両方を含んでいる

source: {% cache %} is not a substitute for fast database connections, efficient templates, or moderate query counts.
ja: {% cache %} は高速なデータベース接続、効率的なテンプレート、または適度なクエリ数に代わるものではありません。

source: where the ‘body’ field contains both “salty” and “dog”.
ja: ‘body’ フィールドに「salty」と「dog」の両方を含む

source: body:"salty dog" | where the body field contains the exact phrase “salty dog”.
ja: body:"salty dog" | body フィールドに正確なフレーズとして「salty dog」を含む

source: body:sal* | where the body field contains a word that begins with “sal”.
ja: body:sal* | body フィールドに「sal」ではじまる単語を含む

source: containing either “salty” or “dog” (or both).
ja: 「salty」または「dog」のいずれか（または、両方）を含んでいる

source: Searching for…
ja: この検索によって

source: body:*ty | where the body field contains a word that ends with “ty”.
ja: body:*ty | body フィールドに「ty」で終わる単語を含む

source: where the ‘body’ field contains either “salty” or “dog”.
ja: ‘body’ フィールドに「salty」または「dog」のいずれかを含む

source: body:*alt* | where the body field contains a word that contains “alt”.
ja: body:*alt* | body フィールドに「alt」を含む単語を含む

source: body::salty | where the body filed is set to “salty” and nothing more.
ja: body::salty | body フィールドに「salty」がセットされ、それ以外のものがない

source: safeUp() is where you should put the main migration code.
ja: safeUp() はメインのマイグレーションコードを記入する場所です。

source: salty OR dog | containing either “salty” or “dog” (or both).
ja: salty OR dog | 「salty」または「dog」のいずれか（または、両方）を含んでいる

source: containing “salty” but not “dog”.
ja: 「salty」を含むが「dog」を含んでいない

source: body::"salty dog" | where the body field is set to “salty dog” and nothing more.
ja: body::"salty dog" | body フィールドに「salty dog」がセットされ、それ以外のものがない

source: where the ‘body’ field contains “salty” but not “dog”.
ja: ‘body’ フィールドに「salty」を含むが「dog」を含まない

source: body::salty* | where the body field begins with “salty”.
ja: body::salty* | body フィールドが「salty」ではじまる

source: will find elements…
ja: こちらのエレメントが見つかるでしょう

source: body::*dog | where the body field ends with “dog”.
ja: body::*dog | body フィールドが「dog」で終わる

source: containing the exact phrase “salty dog”.
ja: 正確なフレーズとして「salty dog」を含んでいる

source: body:* | where the body field contains any value.
ja: body:* | body フィールドになんらかの値を含む

source: where the ‘body’ field contains the exact phrase “salty dog”.
ja: ‘body’ フィールドに正確なフレーズとして「salty dog」を含む

source: -body:* | where the body field is empty.
ja: -body:* | body フィールドが空である

source: salty -dog | containing “salty” but not “dog”.
ja: salty -dog | 「salty」を含むが「dog」を含んでいない

source: containing “salty” in the ‘en_us’ locale.
ja: ‘en_us’ ロケールに「salty」を含んでいる

source: containing a word that begins with “sal”.
ja: 「sal」ではじまる単語を含んでいる

source: containing a word that ends with “ty”.
ja: 「ty」で終わる単語を含んでいる

source: "salty dog" | containing the exact phrase “salty dog”.
ja: "salty dog" | 正確なフレーズとして「salty dog」を含んでいる

source: containing a word that contains “alt”.
ja: 「alt」を含む単語を含んでいる

source: where the ‘body’ field contains a word that begins with “sal”.
ja: ‘body’ フィールドが「sal」ではじまる単語を含む

source: A object, which provides access points to various helper functions and objects for templates.
ja: 様々なヘルパーファンクションやオブジェクトのアクセスポイントを提供する オブジェクト。

source: A DateTime object defining when the cache should expire.
ja: キャッシュの有効期限を DateTime オブジェクトで定義します。

source: A DateTime object set to the current date and time.
ja: 現在の日付と時刻がセットされた DateTime オブジェクト。

source: A craft\elements\Asset, craft\elements\Category, craft\elements\Entry, craft\elements\User, or craft\elements\Tag object
ja: craft\elements\Asset、craft\elements\Category、craft\elements\Entry、craft\elements\User、または craft\elements\Tag オブジェクト

source: A craft\web\twig\variables\CraftVariable object, which provides access points to various helper functions and objects for templates.
ja: 様々なヘルパーファンクションやオブジェクトのアクセスポイントを提供する craft\web\twig\variables\CraftVariable オブジェクト。

source: A translate argument is also available.
ja: translate 引数も利用可能です。

source: A Matrix field loop, where some of the blocks have relational fields on them, adding their own additional database queries to the page
ja: いくつかのブロックが関連フィールドを持ち、独自のデータベースクエリをページに追加している行列フィールドのループ

source: A big list of entries
ja: エントリの大きなリスト

source: A common approach is to store them in a /dev/ folder alongside your Craft projects:
ja: 一般的なアプローチは、Craft プロジェクトと並ぶ /dev/ フォルダに保管することです。

source: A few seconds later, you should have a working Craft install!
ja: 数秒後、Craft のインストールが実行されるでしょう。

source: A final entry template including comments might look like so:
ja: コメント機能を含む最終的なエントリのテンプレートは次のようになります。

source: A good example of this is a yearly archive page, where you want the year to be one of the segments in the URL (e.g. news/archive/2017).
ja: 年を URL のセグメントの1つ（例：news/archive/2017）にする年別アーカイブページが、よい例です。

source: A minimum of 128MB of memory allocated to PHP
ja: 最低128MBの PHP 割当メモリ

source: A minimum of 200MB of free disk space
ja: 最低200MBの空きディスク容量

source: A minimum of 256MB of memory allocated to PHP
ja: 最低256MBの PHP 割当メモリ

source: A modal window will appear where you can define the route settings.
ja: ルートの設定を定義できるモーダルウィンドウが表示されます。

source: A reference to the instance that is driving the template.
ja: テンプレートを駆動している インスタンスへの参照。

source: A reference to the craft\web\View instance that is driving the template.
ja: テンプレートを駆動している craft\web\View インスタンスへの参照。

source: A reference to the main instance (the thing you get when you type Craft::$app in PHP code) is also available to templates via craft.app.
ja: インスタンス（PHP コード内で Craft::$app と記述したときに取得できるもの）への参照は、craft.app 経由でテンプレートでも利用可能です。

source: A reference to the main craft\web\Application instance (the thing you get when you type Craft::$app in PHP code) is also available to templates via craft.app.
ja: メインの craft\web\Application インスタンス（PHP コード内で Craft::$app と記述したときに取得できるもの）への参照は、craft.app 経由でテンプレートでも利用可能です。

source: A section can have one or many entries.
ja: セクションは、1つまたは複数のエントリを持つことができます。

source: A shortcut syntax is also available for output tags that reference a property on the entry:
ja: ショートカット構文は、エントリのプロパティを参照する出力タグでも利用できます。

source: A web server (Apache, Nginx, IIS)
ja: ウェブサーバー（Apache、Nginx、IIS）

source: About Craft CMS
ja: Craft CMS について

source: Accepts
ja: 受け入れる値

source: Access the CP
ja: 管理画面にアクセスする

source: Access the site when the system is off
ja: システムがオフの場合にサイトにアクセスする

source: Accessing Eager-Loaded Elements
ja: Eager-Loaded エレメントへのアクセス

source: Accessing Subpatterns in your Templates
ja: テンプレート内のサブパターンへのアクセス

source: Accessing eager-loaded elements works a little differently than accessing lazy-loaded elements.
ja: eager-loaded エレメントへのアクセスは、lazy-loaded エレメントへのアクセスとは少し異なる働きをします。

source: Action requests either have a URL that begins with actions/ (or whatever your config setting is set to), or an action parameter in the POST request or the query string.
ja: アクションリクエストは、 actions/（または、コンフィグ設定の にセットされたもの）ではじまる URL か、POST リクエストやクエリ文字列に action パラメータのいずれかを持っています。

source: Action requests either have a URL that begins with actions/ (or whatever your actionTrigger config setting is set to), or an action parameter in the POST request or the query string.
ja: アクションリクエストは、actions/（または、コンフィグ設定の actionTrigger にセットされたもの）ではじまる URL か、POST リクエストやクエリ文字列に action パラメータのいずれかを持っています。

source: Add a file input to the form, in the same way you would add a textarea for a Plain Text field:
ja: プレーンテキストフィールドにテキストエリアを追加するのと同じ方法で、フォームにファイル入力欄を追加します。

source: Add a new path repository record, pointed at your plugin’s root directory.
ja: 新しく path repository レコードを追加し、プラグインのルートディレクトリを指定します。

source: Add more columns to the SELECT part of the query
ja: クエリの SELECT パートにカラムを追加

source: Additional Resources
ja: 追加リソース

source: Additionally, all of your Craft templates are pre-loaded with a few global variables:
ja: さらに、すべての Craft テンプレートは、いくつかのグローバル変数があらかじめロードされています。

source: Additionally, the PHP proc_* methods must be enabled in order for Craft to be able to send emails.
ja: さらに、Craft がメール送信できるよう PHP の proc_* メソッドを有効にする必要があります。

source: Additionally, the PHP proc_* methods must be enabled in order to utilize the Plugin Store and to be able to send emails.
ja: さらに、プラグインストアの利用やメールの送信ができるよう PHP の proc_* メソッドを有効にする必要があります。

source: Adds additional ORDER BY columns to the query
ja: 追加の ORDER BY カラムをクエリに付加

source: Adds an additional WHERE condition to the existing one
ja: 既成のものに、追加の WHERE 条件文を付加

source: Adjusting the limit
ja: リミットの調整

source: Admin Accounts
ja: 管理者アカウント
